CSI API ETABS v1

# cPointObjSetMass Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetMass(
    	string Name,
    	ref double[] M,
    	eItemType ItemType = eItemType.Objects,
    	bool IsLocalCSys = true,
    	bool Replace = false
    )

    Function SetMass (
    	Name As String,
    	ByRef M As Double(),
    	Optional ItemType As eItemType = eItemType.Objects,
    	Optional IsLocalCSys As Boolean = true,
    	Optional Replace As Boolean = false
    ) As Integer

    Dim instance As cPointObj
    Dim Name As String
    Dim M As Double()
    Dim ItemType As eItemType
    Dim IsLocalCSys As Boolean
    Dim Replace As Boolean
    Dim returnValue As Integer

    returnValue = instance.SetMass(Name, M,
    	ItemType, IsLocalCSys, Replace)

    int SetMass(
    	String^ Name,
    	array<double>^% M,
    	eItemType ItemType = eItemType::Objects,
    	bool IsLocalCSys = true,
    	bool Replace = false
    )

    abstract SetMass :
            Name : string *
            M : float[] byref *
            ?ItemType : eItemType *
            ?IsLocalCSys : bool *
            ?Replace : bool
    (* Defaults:
            let _ItemType = defaultArg ItemType eItemType.Objects
            let _IsLocalCSys = defaultArg IsLocalCSys true
            let _Replace = defaultArg Replace false
    *)
    -> int

#### Parameters

Name

    Type: SystemString

M

    Type: SystemDouble

ItemType (Optional)

    Type: ETABSv1eItemType

IsLocalCSys (Optional)

    Type: SystemBoolean

Replace (Optional)

    Type: SystemBoolean

#### Return Value

Type: Int32

See Also

#### Reference

cPointObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com